
[toc]

# 20180326 

中国股市大跌， 2018年开年以来的利润殆尽。 用His1963的说法， 好在还没有伤到2018年起始的本金， 已经算是幸运了， 已经战胜了70%的散户了。
我自己的学习账户目前已经缺失7%。 这个学费是昂贵的， 但也是很有意义的， 一方面是更深刻地认识到如何如何选股， 如何制作； 
另一方面是一露面就先接受市场给的一个下马威， 跌到谷底。然后从谷底一点点磨练耐心，磨练忍耐， 通过学习实战获得信心， 一点点往高处走。 这个过程对一个初学者， 
对一个这么久没有经历过大压力挑战的人来说是很有意义的。 我希望从中受益。 

早上去了颐和园拍照。 小相机在近距离拍人拍景都是不错的， 但其实还是很不灵活： 当距离一大，没有变焦能力就严重限制了能拍摄的内容； 不过胜在轻便。 
如果只是单纯朋友圈发相处， 画质差点也就差点吧。 😌😅

手机号转移有点问题， 必须得去东四十条了。 但愿那里一次搞定。 

#20180327

看上去明天可以在附近将手机号码转移了。 希望这个烦恼得到解决

今天的时间安排基本上按照计划进行的。 感觉又有一点微弱的进度， 还是很开心的。 

市场的表现并不是像美国市场那么强劲。 A股和美股的不同步， 或者说A股的诡异(正常）表现， 还需要花点时间理解并指导自己的投资。 

4月旅行的计划已经确定。 洛阳的酒店已经订了， 不可取消。 那就尽量去吧。

# 20180328

最终还是去上望京才将手机号的事办完。然后就顺便和韩超吃了个饭， 聊了下分别之后仿真组及各自的感受。 

正如想象之中， 仿真组的每个人都感受到了巨大的变化。 也会有一些不舒服的感觉。 毕竟彼此的信任还没建立。 这需要一个过程， 建立信任， 完全适应变化。 
我还是愿意相信变化从长远来说对大家是好的。 如果真能如此， 也不枉我用自己的职业换取大家的进步了。 
有一些人肯定会觉得不爽， 正好触发一个自然的淘汰。 

今天的学习任务基本完成。 市场继续下跌，外围恐慌情绪以及机构的恶势力目前压倒了价值投资。 
站在我的角度，继教为中国平安这次操作懊恼， 继续思考以后如何避免类似的错误。 明天和郭都是再讨论一下这个话题。 
另外继续通过这个炼狱时段磨炼自己的意志和耐心。 
不知道我如此的再现， 是不是给郭老师更大的压力？ 

# 20180329

1 PB 市净率
2 PE 市盈率
3 PE/G 预期市盈率
4 PEG 市盈率与业绩增长率之比
5 EPS 每股收益
6 ROE 净资产收益率

1、PB称为市净率，也就是市价除以每股净资产； 什么是PB（平均市净率）?平均市净率=股价/账面价值。
其中，账面价值=总资产-无形资产-负债-优先股权益。可以看出，所谓账面价值是公司解散： 清算的价值。
如果公司要清算，那么先要还债，无形资产则将不复存在，而优先股的优先权之一就是清算的时候先分钱，但是本股市没有优先股。
这样，用每股净资产来代替账面价值，则PB就是大家理解的市净率，即：PB（市净率）=股价/每股净资

2、PE称为市盈率，也就是市价除以每股收益
3、PE/G是预期市盈率，也就是市价除以今年预期每股收益。
因为当前只能知道上一年的每股收益，所以今年预期每股收益可能不同的研究员预期的不一样，相应的PE/G也就不一样。但PB、PE是不会不一样的。

4、PEG，即“市盈率与业绩增长率之比”。如果用PEG衡量，美国为2倍，中国只有1倍，而业绩增长预期是评估之本。
但中国股市应有其相对独立的估值。中国有很多股票还是被低估，远远没有见顶。

5、EPS是指每股收益。每股收益又称每股税后利润、每股盈余，是分析每股价值的一个基础性指标。
传统的每股收益指标计算公式为：每股收益＝期末净利润÷期末总股本。每股收益突出了分摊到每一份股票上的盈利数额，是股票市场上按市盈率定价的基础。如果一家公司的净利润很大，但每股盈利却很小，表明它的业绩背过分稀释，每股价格通常不高。

6、ROE,即净资产收益率（Rate of Return on Common Stockholders’ Equity ）的英文简称，又称股东权益报酬率。
作为判断上市公司盈利能力的一项重要指标，一直受到证券市场参与各方的极大关注。
分析师将ROE解释为将公司盈余再投资以产生更多收益的能力。
它也是衡量公司内部财务、行销及经营绩效的指标。 ROE的计算方法是：净资产收益率＝报告期净利润／报告期末净资产。
绝对估值法：按照国际惯例，证券公司的估值一般用ROE/COE模型，计算公式为（ROE-g）/（COE－g）。
其中ROE（净资产收益率）为证券司的长期ROE水平，g为长期增长率，COE为股权成本率；COE的计算公式为：无风险收益率＋市场风险溢价×贝它值。

如何定义一支执有的股票是否回本？有两大类思路。 
第一种思路，就是市场上炒短线的人们的思绪，完全不关心股票的内心价值， 而只看重卖出点和买入点差价。当差价为正， 就叫回本； 否则就是损失。 
第二种思路，就是假设股票价格不变， 看股票的价格什么时候可以超过每股净资产。 基本思路就是如果通过清算来兑现股票成本， 需要多长时间清算价格可以超过股票价格。 
这里， 又可以用不同的计算方法来评估
2.1 用PB衡量
2.2 用PE衡量
2.3 用净资产增长周期来看，(用市净率看）
假定N_years后可以净资产可以到达目前股价, 净资产增长率是g. 
BV_new=current_stock_price(P)=BV_now*(1+g)^N_years_1
so N_years_1 = (logP-logBV_now)/log(1+g)= logPB/log(1+g)

2.4 用市盈率来看， 也就是通过每股盈利及每年盈利增长的情况下来看多长时间可以回本
BV_new=current_stock_price(P)= BV_now + EPS*(1+g)^N_years_2
N_years_2 = log((P-BV_now)/EPS)/log(1+g) < log(P/EPS)/log(1+g) = log(PE)/log(1+g)

在上面的计算中没有考虑股价实际上是波动的， 而且在较高增长率的驱动下， 股份也是大概率事件上涨。 可以再从两个角度来看新的股价的估计值： 

2.5 假设市净率维持不变， 那么在N_years_1或者N_years_2时，新的股价就是BV_new*PB, 那么股价波动带来的收益部分就是： 
delta_P = BV_new*PB - P 
就是 P*PB-P= P*(PB-1), 相对收益率就是： (PB-1)*100

2.6, 假设市盈率维持不变， 那么在N_years_1或者N_years_2时，新的股价就是EPS*(1+g)^N_year*PE, 那么股价波动带来的收益部分就是： 
delta_P =  EPS*(1+g)^N_year*PE - P = P*(1+g)^N_year - P = P*( (1+g)^N_year -1)
相对收益率就是： ((1+g)^N_year-1)*100

而事实上， 对于一个稳定高增长的公司， 其股价的PB及PE都会增大， 从而会带来更高的股价溢价部分。 
那么2.5就可以修正为相对收益是： (PB_new-1)*100, 相对2.5的额外部分是 (PB_new-PB)*100%

假设新的PE_new = PE + delta_PE, 2.6 delta_P 就查以修正为: 
EPS*(1+g)^N_year*PE_new - P = P*(1+g)^N_year - P + delta_PE_*EPS*(1+g)^N_year= P*( (1+g)^N_year -1) + delta_PE*EPS*(1+g)^N_Years
相对收益就是 
delta_P/P = (1+g)^N_years-1 + delta_PE*EPS/P*(1+g)^N_years 
=(1+g)^N_years-1 + delta_PE*EPS/(EPS*PE)*(1+g)^N_years 
=(1+g)^N_years-1 + delta_PE/PE*(1+g)^N_years 
= (1+delta_PE/PE)*(1+g)^N_years -1


在N年后股票增值比例为 delta_P的情况下， 可计算复合每年收益率为： 10^(1og （delta_P+1)/N) -1

完成了基于以上分析的长期收盈计算器。 

今天另一个学习心得就是战胜恐惧何其不易。 不过基于上面的学习心得， 以我目前的平安成本价，如果一直持有的话， 6年后的市净率就相当于是1了。 
所以其时的收益就是当时的市净率。 而平安的市净率一直在3左右， 所以6年后股票的收益就是200%，年化收益可走过20%。 

# 20180330

想了想， 要不要现在再转5万元到股票账户中， 然后买入华夏幸福后满仓。 后来决定还是不这么做了。 
1. DPD主要操作600340就好。 华夏幸福会不会继续下探呢？ 如果它上涨， 有DPD那边守住收盈。如果下降， 我就更没必要扩大损失了。 
2. 还是留着银子，为自己下一步的进攻留点弹药。 
3.华夏最近确实不稳。

所以我接下来练习的方向应该是： 
1. 中国平安保持被套的状态。 
2. 农业银行继续持有至5月中下旬，收到分红后
3. 农业银行要不要再追加？ 取决于还有没有其它看得上的股票。 
4. 寻找下一支需要分析的股票。利用大数投资方法。 

# 2018 cw13 summary

成为自由职业者的第二周过去了。 

在投资专业方面的学习，4点收获：

1. 对一个股票的长期投资价值做了计算器，有助对股票的长期价值一些分析。 当然这个计算器中是完全不考虑短期波动的种种可能。 
2. 对齐东平的大数投资天理论进行了学习。我认为，这套理论及方法， 理论上是可以模拟整个A股的趋势并在长期获利。
基于书中的比较具体的选股方法， 确实也适用于没时间深入研究股票从而选股的投资者。 但是，这个理论有几个不足： 
1）随机选股这步， 有可能会漏掉更低估值的股票。
2）对估值的判断及未来盈利的估计，也是建立在A股全盘的基准上，并不能反映行业特点。 
当然逆向操作， 这一点是靠谱的。 
对于我和DPD这样的准专职投资者，目标当然是要跑赢大盘， 所以变是更精细地基于护城河及安全边界就行选股。然后是长期执有及逆向操作。 
3. 为了在A股市场上控制更大的波动， 还是要严格执行适度分散。 组合中要有稳定及风险小的品种， 及高收益（同时也可能是高波动性)的股票。 
4. 中美贸易战及美国股市走到高估值的阶段，对A股的影响 （短期波动性及中期的熊态）还是巨大的，选股及选时必须要考虑这方面的影响。 

周六的时候， 大学同学聚会， 还和延海梅见了面。 基本上的感受就是，在我自己看来的大事，大家也就是礼貌地聊聊而已。 
每个人都已经被其它事情占据的满满的， 几乎没有谁会真正关心我的这个决定的来龙去脉究竟几何。 
甚至延海梅，甚至朴勇梅。 都没有问过为什么， 也没有问过新的计划。 这便是所谓的好朋友。 其实还是有些失望。 
但同时也意识到两点： 我不是任何人的谁谁谁； 真正关心我的人是父母家人还有DPD. 万幸， 还有DPD. 
所以也是时候停止辞职的自得和兴奋了。 
为此， 罗列一下当为和当不为的一些事。 

当为之： - 静心做好最重要的事，为了三年以后的自如
1. 继续阅读投资方面的经典图书，争取在旅行之前读完彼得林奇和Kindle里的一本投资书
2. 深度阅读华夏幸福的年报及外围资讯， 和dpd讨论这支股票的价值同形成一个共识。 
3. 深度阅读东方园林的年报及外围资讯， 和dpd讨论这支股票的价值同形成一个共识。 
4. 阅读Sony RX1R 的说明书，了解掌握此相机更多的功能。 
5. 慢阅读并总结到阅读心得的订阅号
6. 跟踪科技微信， 慢阅读 
7. 运动

不当为： 
1. 克制出现在朋友圈的想法。不管如何，你都不能是大家关注的某个重点。 没有谁希望通过朋友圈真的了解关心你。和朋友们讨论自己的离职。 
2. 急切或者快速阅读
3. 对原来工作事务的涉及
4. 脱离计划做轻松的事情
5. 周一至周4， 追剧时间超过2小时。 要减少到至多一小时。 






